---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.DefaultParamaterValuesIncorrect
source: html/3ca04b0b-1f42-6ad2-5bcd-af1c1dd5e58f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.DefaultParamaterValuesIncorrect Property

Default parameters have incorrect values. One reason for failure might be an edge length that is too short (it's smaller than bent radius).

## Syntax (C#)
```csharp
public static FailureDefinitionId DefaultParamaterValuesIncorrect { get; }
```